// задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("imput a first number' ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("imput a second number' ");
int num2 = Convert.ToInt32(Console.ReadLine());
int max = num1;

if(num1 > max) max = num1;
if(num2 > max) max = num2;

Console.WriteLine(max);
*/
